pascal-4.0/tutorials/surfaceTracking/interTrackEddyCurrentFoam/rgs2D_Coarse/constant/eddyCurrentProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      eddyCurrentProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
{
    conductor          region_conductor;
}

settings
{
    biotSavart         false;
    lorentzForce       true;
    magneticPressure   false;
    jouleHeat          false;
}

storage
{
    "(BRe|BIm)"
    {
        write          false;
    }

    "FL"
    {
        write          false;
    }

    region_conductor
    {
        "(jRe|jIm)"
        {
            write      false;
        }
    }
}

// ************************************************************************* //
