pascal-4.0/tutorials/surfaceTracking/interTrackEddyCurrentFoam/rgs2D_Coarse/system/region_conductor/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                           none;
}

gradSchemes
{
    default                           none;
}

divSchemes
{
    default                           none;
}

laplacianSchemes
{
    default                           none;
}

interpolationSchemes
{
    default                           none;

    interpolate(ARe)                  linear;
    interpolate(AIm)                  linear;
}

// ************************************************************************* //
